[
	{
		"id": "CVE-2004-2340",
		"description": "** UNVERIFIABLE **  SQL injection vulnerability in PunkBuster Screenshot Database (PB-DB) Alpha 6 allows remote attackers to execute arbitrary SQL commands via the username and password fields of the login form.  NOTE: the original vulnerability report contains several significant inconsistencies that make it unclear whether the report is accurate, including (1) PB-DB is really the \"PunkBuster Screenshot Database\" and not \"PunkBuster\" itself; (2) there is no apparent association between PunkBuster and \"Punky Brewster\"; (3) the claimed source code is not anywhere in Alpha 6.",
		"hardware": [],
		"software": [],
		"references": [
			"http://www.securityfocus.com/bid/9697",
			"https://exchange.xforce.ibmcloud.com/vulnerabilities/15267",
			"http://securitytracker.com/id?1009145",
			"http://www.securityfocus.com/archive/1/354453",
			"http://www.osvdb.org/18981"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2005-1347",
		"description": "** UNVERIFIABLE **  NOTE: this issue describes a problem that can not be independently verified as of 20050421.  Adobe Acrobat reader (AcroRd32.exe) 6.0 and earlier allows remote attackers to cause a denial of service (\"Invalid-ID-Handle-Error\" error) and modify memory beginning at a particular address, possibly allowing the execution of arbitrary code, via a crafted PDF file.  NOTE: the vendor has stated that the reporter refused to provide sufficient details to confirm the issue.  In addition, due to the lack of details in the original advisory, an independent verification is not possible.  Finally, the reliability of the original reporter is unknown.  This item has only been assigned a CVE identifier for tracking purposes, and to serve as a concrete example of the newly defined UNVERIFIABLE and PRERELEASE content decisions in CVE, which must be discussed by the Editorial Board. Without additional details or independent verification by reliable sources, it is highly likely that this item will be REJECTED.",
		"hardware": [],
		"software": [],
		"references": [
			"http://www.securityfocus.com/bid/13265",
			"http://www.osvdb.org/15850",
			"http://securitytracker.com/id?1013774",
			"http://www.alphahackers.com/advisories/acrobat6.txt",
			"https://exchange.xforce.ibmcloud.com/vulnerabilities/20216"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2005-4126",
		"description": "** UNVERIFIABLE, PRERELEASE **  NOTE: this issue describes a problem that can not be independently verified as of 20051208.  Unspecified vulnerability in unspecified versions of Real Networks RealPlayer allows attackers to execute arbitrary code.  NOTE: the information regarding this issue is extremely vague and does not provide any verifiable information.  It has been posted by a reliable reporter with a prerelease disclosure policy.  This item has only been assigned a CVE identifier for tracking purposes, and to serve as a concrete example for discussion of the newly emerging UNVERIFIABLE and PRERELEASE content decisions in CVE, which must be discussed by the Editorial Board.  Without additional details or independent verification by reliable sources, it is possible that this item might be RECAST or REJECTED.",
		"hardware": [],
		"software": [],
		"references": [
			"http://www.securityfocus.com/bid/15691",
			"http://www.eeye.com/html/research/upcoming/20051130.html"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2005-4130",
		"description": "** UNVERIFIABLE, PRERELEASE **  NOTE: this issue describes a problem that can not be independently verified as of 20051208.  Unspecified vulnerability in unspecified versions of Real Networks RealPlayer allows remote attackers to execute arbitrary code.  NOTE: it is not known whether this issue should be MERGED with CVE-2005-4126.  The information regarding this issue is extremely vague and does not provide any verifiable information.  It has been posted by a reliable reporter with a prerelease disclosure policy.  This item has only been assigned a CVE identifier for tracking purposes, and to serve as a concrete example for discussion of the newly emerging UNVERIFIABLE and PRERELEASE content decisions in CVE, which must be discussed by the Editorial Board.  Without additional details or independent verification by reliable sources, it is possible that this item might be RECAST or REJECTED.",
		"hardware": [],
		"software": [],
		"references": [
			"http://www.eeye.com/html/research/upcoming/20051116.html"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2006-2641",
		"description": "** UNVERIFIABLE **  NOTE: this issue does not contain any verifiable or actionable details.  Cross-site scripting (XSS) vulnerability in John Frank Asset Manager (AssetMan) 2.4a and earlier allows remote attackers to inject arbitrary web script or HTML via \"any of its input.\"  NOTE: the original disclosure is based on vague researcher claims without vendor acknowledgement; therefore this identifier cannot be linked with any future identifier that identifies more specific vectors.  Perhaps this should not be included in CVE.",
		"hardware": [],
		"software": [],
		"references": [
			"http://www.securityfocus.com/bid/18131",
			"http://www.vupen.com/english/advisories/2006/2023",
			"http://www.securityfocus.com/archive/1/435139/100/0/threaded",
			"https://exchange.xforce.ibmcloud.com/vulnerabilities/26702",
			"http://secunia.com/advisories/20285",
			"http://securityreason.com/securityalert/979"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2006-2642",
		"description": "** UNVERIFIABLE **  NOTE: this issue does not contain any verifiable or actionable details.  Cross-site scripting (XSS) vulnerability in Marco M. F. De Santis Php-residence 0.6 and earlier allows remote attackers to inject arbitrary web script or HTML via \"any of its input.\"  NOTE: the original disclosure is based on vague researcher claims without vendor acknowledgement; therefore this identifier cannot be linked with any future identifier that identifies more specific vectors.  Perhaps this should not be included in CVE.",
		"hardware": [],
		"software": [],
		"references": [
			"https://exchange.xforce.ibmcloud.com/vulnerabilities/26701",
			"http://www.vupen.com/english/advisories/2006/2025",
			"http://secunia.com/advisories/20311",
			"http://www.securityfocus.com/archive/1/435131/100/0/threaded",
			"http://www.securityfocus.com/bid/18133",
			"http://securityreason.com/securityalert/978"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2006-3601",
		"description": "** UNVERIFIABLE **  Unspecified vulnerability in an unspecified DNN Modules module for DotNetNuke (.net nuke) allows remote attackers to gain privileges via unspecified vectors, as used in an attack against the Microsoft France web site.  NOTE: due to the lack of details and uncertainty about which product is affected, this claim is not independently verifiable.",
		"hardware": [],
		"software": [],
		"references": [
			"http://securitytracker.com/id?1016332",
			"http://www.securityfocus.com/bid/18522",
			"http://www.zone-h.org/content/view/4770/31/"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2020-9314",
		"description": "** PRODUCT NOT SUPPORTED WHEN ASSIGNED ** Oracle iPlanet Web Server 7.0.x allows image injection in the Administration console via the productNameSrc parameter to an admingui URI. This issue exists because of an incomplete fix for CVE-2012-0516. NOTE: a related support policy can be found in the www.oracle.com references attached to this CVE.",
		"hardware": [],
		"software": [],
		"references": [
			"https://www.oracle.com/support/lifetime-support/",
			"https://www.oracle.com/us/assets/lifetime-support-middleware-069163.pdf",
			"https://wwws.nightwatchcybersecurity.com/2020/05/10/two-vulnerabilities-in-oracles-iplanet-web-server-cve-2020-9315-and-cve-2020-9314/",
			"http://seclists.org/fulldisclosure/2020/May/31"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2020-9315",
		"description": "** PRODUCT NOT SUPPORTED WHEN ASSIGNED ** Oracle iPlanet Web Server 7.0.x has Incorrect Access Control for admingui/version URIs in the Administration console, as demonstrated by unauthenticated read access to encryption keys. NOTE: a related support policy can be found in the www.oracle.com references attached to this CVE.",
		"hardware": [],
		"software": [],
		"references": [
			"https://www.oracle.com/support/lifetime-support/",
			"https://www.oracle.com/us/assets/lifetime-support-middleware-069163.pdf",
			"https://wwws.nightwatchcybersecurity.com/2020/05/10/two-vulnerabilities-in-oracles-iplanet-web-server-cve-2020-9315-and-cve-2020-9314/",
			"http://seclists.org/fulldisclosure/2020/May/31"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2020-14042",
		"description": "** PRODUCT NOT SUPPORTED WHEN ASSIGNED ** A Cross Site Scripting (XSS) vulnerability was found in Codiad v1.7.8 and later. The vulnerability occurs because of improper sanitization of the folder's name $path variable in components/filemanager/class.filemanager.php. NOTE: the vendor states \"Codiad is no longer under active maintenance by core contributors.\"",
		"hardware": [],
		"software": [],
		"references": [
			"https://github.com/Codiad/Codiad/blob/master/README.md",
			"https://github.com/Codiad/Codiad/issues/1122",
			"https://advisory.checkmarx.net/advisory/CX-2020-4278"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2020-14043",
		"description": "** PRODUCT NOT SUPPORTED WHEN ASSIGNED ** A Cross Side Request Forgery (CSRF) vulnerability was found in Codiad v1.7.8 and later. The request to download a plugin from the marketplace is only available to admin users and it isn't CSRF protected in components/market/controller.php. This might cause admins to make a vulnerable request without them knowing and result in remote code execution. NOTE: the vendor states \"Codiad is no longer under active maintenance by core contributors.\"",
		"hardware": [],
		"software": [],
		"references": [
			"https://github.com/Codiad/Codiad/blob/master/README.md",
			"https://github.com/Codiad/Codiad/issues/1122",
			"https://advisory.checkmarx.net/advisory/CX-2020-4279"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2020-14044",
		"description": "** PRODUCT NOT SUPPORTED WHEN ASSIGNED ** A Server-Side Request Forgery (SSRF) vulnerability was found in Codiad v1.7.8 and later. A user with admin privileges could use the plugin install feature to make the server request any URL via components/market/class.market.php. This could potentially result in remote code execution. NOTE: the vendor states \"Codiad is no longer under active maintenance by core contributors.\"",
		"hardware": [],
		"software": [],
		"references": [
			"https://github.com/Codiad/Codiad/blob/master/README.md",
			"https://github.com/Codiad/Codiad/issues/1122",
			"https://advisory.checkmarx.net/advisory/CX-2020-4280"
		],
		"_edited_": false
	},
	{
		"id": "CVE-2020-23355",
		"description": "** PRODUCT NOT SUPPORTED WHEN ASSIGNED ** Codiad 2.8.4 /componetns/user/class.user.php:Authenticate() is vulnerable in magic hash authentication bypass. If encrypted or hash value for the passwords form certain formats of magic hash, e.g, 0e123, another hash value 0e234 something can successfully authenticate.",
		"hardware": [],
		"software": [],
		"references": [
			"https://github.com/Codiad/Codiad/issues/1121"
		],
		"_edited_": false
	}
]